#include "Code_Classesr.h"
#include <iostream>
#include <vector>
using namespace std;
void Screen_Decor::Type_of_beginning() {
	cout << "                      *       ^^                                            &&         *               " << endl;
	cout << "                *            -[]-             = = = = = = = = = = =        -[]-                " << endl;
	cout << "                         *    ||              =  Добро пожаловать =    *    ||\n                             *                =                   =\n                              *               =     LagaetCar2    =    *        *" << endl;
	cout << "        = = = = = = = = = = = = = = = = = = = =                   = = = = = = = = = = = = = = = = = = =" << endl;
	cout << "        =                                                                                             =\n        =  Для управления этим приложением вписывайте слова, которые выделены квадратными скобками [] =" << endl;
	cout << "        = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =" << endl;
	cout << "                \n   \n                            *       [Авторы] *                *       [Выход]      * *   \n                                *                  [Продолжить]  * " << endl;
	cout << "                             \n   \n               *                 [Подробности]      *                [Инструкция]     *     * " << endl;
	cout << "        _______________________________________________________________________________________________\n\n\n" << endl;
};
void Screen_Decor::Menu_Center(int* Quantity, int* _number_of_words) {
	cout << "                \n\n" << endl;
	cout << "                = -------------------------------------------------------------------------------- =" << endl;
	cout << "                =              +                     =         =        Увидеть людей              = " << endl;
	cout << "                =      Зарегистрируемся!+           =  =     =  =           [Все]         +        =    " << endl;
	cout << "                =       [Регистрация]             =     = =     =                                  =  " << endl;
	cout << "                =                                 =  LagaetCat 2  =             +                  =  " << endl;
	cout << "                =                                 =  --      ()   =     Комната наказаний))        =    " << endl;
	cout << "                =       +             +         =                   =         [Бан]          +     =  " << endl;
	cout << "                =        Поговорим)            =      =- || -=       =         +                   =   " << endl;
	cout << "                =           [Чат]               =        __         =            Сообщения(" << *_number_of_words << ")     = " << endl;
	cout << "                =                                 =               =                 +              =  " << endl;
	cout << "                =          +                        =----()-----=                                  =   " << endl;
	cout << "                =                                    =         =           Повернем к хвосту!      =" << endl;
	cout << "                =                                  = Количество  =     =         [Назад]           =   " << endl;
	cout << "                =        Уйдем спать...  +       ==участников:" << *Quantity << " == =                            = " << endl;
	cout << "                =           [Выход]                   = = == = =    ==                             =  " << endl;
	cout << "                =                                     = =    = =                   +               =   " << endl;
	cout << "                =                                     ===    ===                             +     =   " << endl;
	cout << "                =          -------------------------------------------------------------           =" << endl;
	cout << "                ____________________________________________________________________________________\n\n\n  " << endl;
};
void Screen_Decor::View_of_the_registration_screen() {
	cout << "                                                          " << endl;
	cout << "            *                      *                        " << endl;
	cout << "                                                          " << endl;
	cout << "                                 -)        (-          *           " << endl;
	cout << "               *       __  __      )      (     Слушай меня внимательно!                   " << endl;
	cout << "      -- - -      -  -        _ _ (||)  (||)    Тебе нужно вписать сначало                  " << endl;
	cout << "             -    -            )     _!!_       логин,и при этом тот которого нет,                 " << endl;
	cout << "              -  -      _ _       {        }    после любой пароль и твое имя.                  " << endl;
	cout << "                   - - --- --- --- { }  } }     И все!                  " << endl;
	cout << "       *          ||  ||          ||     ||         *              " << endl;
	cout << "                 ||   ||           ||   ||                     " << endl;
	cout << "_____________________________________________________________________________________  " << endl;
};